In [1]:
(1-0.05)**20  #complete value % of 5% missing value with 20 variables

0.3584859224085419

In [2]:
import numpy as np
import pandas as pd

In [3]:
NBA_dict = {'player' : ['Stephen Curry', 'Bradley Beal', 'Damian Lillard', 'Joel Embiid', 'Giannis Antetokounmpo'],
              'team' : ['GSW', 'WAS', 'POR', 'PHI', 'MIL'],
              'points/game' : [32, 31.3, 28.8, 28.5, 28.1]}

In [4]:
NBA = pd.DataFrame(NBA_dict)

In [5]:
NBA

                  player team  points/game
0          Stephen Curry  GSW         32.0
1           Bradley Beal  WAS         31.3
2         Damian Lillard  POR         28.8
3            Joel Embiid  PHI         28.5
4  Giannis Antetokounmpo  MIL         28.1

In [6]:
NBA.loc[len(NBA),:] = ['a','b','c']

In [7]:
NBA

                  player team points/game
0          Stephen Curry  GSW          32
1           Bradley Beal  WAS        31.3
2         Damian Lillard  POR        28.8
3            Joel Embiid  PHI        28.5
4  Giannis Antetokounmpo  MIL        28.1
5                      a    b           c

In [8]:
sales = pd.read_csv('sales.csv')

In [9]:
sales

   categories  Sunday  Monday  Tuesday  Wednesday  Thursday  Friday  Saturday
0       apple  7492.0  8927.0   4390.0        NaN    9323.0  5832.0    5930.0
1      banana  5832.0  3050.0      NaN     6020.0       NaN  4920.0    8392.0
2       mango     NaN  6940.0   8593.0     9302.0    4802.0  5849.0    5930.0
3         NaN  5739.0  9604.0   3020.0     8694.0    2940.0  5302.0    6940.0
4  strawberry     NaN  4964.0   9044.0     6936.0    9604.0     NaN    3296.0
5   blueberry  5963.0  3959.0   6005.0     4965.0       NaN  9573.0       NaN
6       peach  6406.0     NaN   4384.0        NaN    5318.0  3950.0    8393.0
7  watermelon  5396.0     NaN   5329.0     2368.0    8392.0  5286.0       NaN

In [10]:
Nonemissing = sales.dropna()

In [11]:
Nonemissing

Empty DataFrame
Columns: [categories, Sunday, Monday, Tuesday, Wednesday, Thursday, Friday, Saturday]
Index: []

In [12]:
sales.notnull()

   categories  Sunday  Monday  Tuesday  Wednesday  Thursday  Friday  Saturday
0        True    True    True     True      False      True    True      True
1        True    True    True    False       True     False    True      True
2        True   False    True     True       True      True    True      True
3       False    True    True     True       True      True    True      True
4        True   False    True     True       True      True   False      True
5        True    True    True     True       True     False    True     False
6        True    True   False     True      False      True    True      True
7        True    True   False     True       True      True    True     False

In [13]:
sales[sales['Wednesday'].notnull()]

   categories  Sunday  Monday  Tuesday  Wednesday  Thursday  Friday  Saturday
1      banana  5832.0  3050.0      NaN     6020.0       NaN  4920.0    8392.0
2       mango     NaN  6940.0   8593.0     9302.0    4802.0  5849.0    5930.0
3         NaN  5739.0  9604.0   3020.0     8694.0    2940.0  5302.0    6940.0
4  strawberry     NaN  4964.0   9044.0     6936.0    9604.0     NaN    3296.0
5   blueberry  5963.0  3959.0   6005.0     4965.0       NaN  9573.0       NaN
7  watermelon  5396.0     NaN   5329.0     2368.0    8392.0  5286.0       NaN

In [14]:
sales['Wednesday'].isnull()

0     True
1    False
2    False
3    False
4    False
5    False
6     True
7    False
Name: Wednesday, dtype: bool

In [15]:
sales.isnull().sum()  #Ture = 1, False = 0

categories    1
Sunday        2
Monday        2
Tuesday       1
Wednesday     2
Thursday      2
Friday        1
Saturday      2
dtype: int64

In [16]:
a = sales.isnull().sum()  #Ture = 1, False = 0

In [17]:
type(a)

pandas.core.series.Series

In [18]:
a[0]

1

In [19]:
a[1]

2

In [20]:
a.index

Index(['categories', 'Sunday', 'Monday', 'Tuesday', 'Wednesday', 'Thursday',
       'Friday', 'Saturday'],
      dtype='object')

In [21]:
sales.fillna(sales.mean())

,categories,Sunday,Monday,Tuesday,Wednesday,Thursday,Friday,Saturday
0,apple,7492.0,8927.000000,4390.000000,6380.833333,9323.000000,5832.0,5930.000000
1,banana,5832.0,3050.000000,5823.571429,6020.000000,6729.833333,4920.0,8392.000000
2,mango,6138.0,6940.000000,8593.000000,9302.000000,4802.000000,5849.0,5930.000000
3,NaN,5739.0,9604.000000,3020.000000,8694.000000,2940.000000,5302.0,6940.000000
4,strawberry,6138.0,4964.000000,9044.000000,6936.000000,9604.000000,5816.0,3296.000000
5,blueberry,5963.0,3959.000000,6005.000000,4965.000000,6729.833333,9573.0,6480.166667
6,peach,6406.0,6240.666667,4384.000000,6380.833333,5318.000000,3950.0,8393.000000
7,watermelon,5396.0,6240.666667,5329.000000,2368.000000,8392.000000,5286.0,6480.166667

In [22]:
sales['Sunday'].mean()

6138.0

In [23]:
sales.mean()

Sunday       6138.000000
Monday       6240.666667
Tuesday      5823.571429
Wednesday    6380.833333
Thursday     6729.833333
Friday       5816.000000
Saturday     6480.166667
dtype: float64